/*
 * @Author: Salt
 * @Date: 2022-04-30 13:42:59
 * @LastEditors: Salt
 * @LastEditTime: 2022-04-30 19:43:28
 * @Description: 检查垃圾内容会用到的东西
 * @FilePath: \better-tieba\src\modules\antiSpam\constant.ts
 */
export const checkedSign = 'salt-anti-spam-checked'
/** 审查页面标题部分 */
export const titleList = [
  '.threadlist_title',
  '.core_title_txt',
  '.s_post_list .p_title',
].map((str) => str + `:not(.${checkedSign})`)
/** 审查帖子内容部分 */
export const contentList = [
  '.d_post_content',
  '.threadlist_text',
  '.lzl_content_main',
].map((str) => str + `:not(.${checkedSign})`)
/** 所有需要审查的部分 */
export const checkList = [...contentList, ...titleList]
/** 广告类型 */
export const ADVERTIS = 1
/** 色情类型 */
export const SALACITY = 2
/** 粗口类型 */
export const SWEARING = 3
/** 用于标记的类名 */
export const classes: { [type: number]: string } = {
  [ADVERTIS]: 'salt-anti-spam-checked-ad',
  [SALACITY]: 'salt-anti-spam-checked-sq',
  [SWEARING]: 'salt-anti-spam-checked-ck',
}
/** 用于标记按钮的类名 */
export const btnClasses: { [type: number]: string } = {
  [ADVERTIS]: 'salt-anti-spam-action-btn-ad',
  [SALACITY]: 'salt-anti-spam-action-btn-sq',
  [SWEARING]: 'salt-anti-spam-action-btn-ck',
}
/** 用于标记的颜色 */
export const colors: { [type: number]: string } = {
  [ADVERTIS]: '#ec1349',
  [SALACITY]: '#d4a411',
  [SWEARING]: '#3bbd0f',
}
/** 用于按钮的文本 */
export const texts: { [type: number]: string } = {
  [ADVERTIS]: '疑似广告',
  [SALACITY]: '可能麦片',
  [SWEARING]: '疑似粗口',
}
/** 审查用的正则表达式 */
export const vetReg: { [type: number]: RegExp[] } = {
  [ADVERTIS]: [
    /置顶\|(主题|[贴帖]子)|接.*(发帖|置顶).*(发帖|置顶)/, //置顶帖子的广告 0.1.0
    /9.{0,2}2.{0,2}5.{0,2}0.{0,2}4.{0,2}9.{0,2}8.{0,2}1.{0,2}9/, //黑名单QQ群——服务器宣传 0.1.0
    /[仙剑武][剑侠].*(进?手?[游蝣]戏?|新区).*([招来]|[新上].?[服区线号])/, //仙侠游戏 0.1.1
    /(进?手?[游蝣遊][戏戲]?|新区).*(体验|每[日天周月]|上线|充值).*(648|充值|福利)|[每天日送].*648.{0,3}真实.{0,3}[充沖冲][值前直]/, //卖游戏 0.1.0
    /送.*(首充|[大豪]礼|礼包).*(进?手?游戏?|新区).*(福利|号)/, //
    /尚品核雕|[徽微嶶薇vV][xX信].+(配台电脑)|潮革圭|搜.*小白基地|[陶淘].{0,3}手.{0,3}游|分.{0,3}信.{0,3}查|创.{0,3}融.{0,3}链|随.{0,3}风.{0,3}查/, //黑名单：尚品核雕、配台电脑、潮革圭、小白基地、陶手游、分信查、创融链、随风查 0.1.0
    /(爱奇艺|优酷|网易云|[网云]盘).*会员.*(一年|99|批发)/, //我缺钱，不买了 0.1.0
    /([百摆].?[度渡]|[支之].?[付附]).*搜.*谢/, //百度/支付宝上搜盐的删帖能力，你会回来谢我的 0.1.0
    /(喜欢|爱).*(手?[机鸡]?游戏?).*[加夹甲+＋].{0,5}[徽微嶶薇vV]/, // 算了算了 0.1.2
    /[定订][做制].*[工厂][家厂].*直接?[发销]/, // 穷到不择手段发广告了，还指望啥 0.1.2
    //((武器|炫酷|劲爆|刺激|锻造|分解|强化|结婚|格雷|工业|植物?魔法?|拔刀剑?|宝可梦|精灵|魂[骨骸器核]|[灵魂]宠|新服).{0,6}){2,3}.*福利.*进服.*送.*[\d一二三四五六七八九十]/, //推销服务器 0.1.2
    /解封.*([徽微嶶薇vV][xX信]|[Qq扣企][Qq扣鹅])/, // 人在做天在看 0.1.2
    /微信群.*学习.*交流.*进群/, // 塞翁一族交流群 0.1.3
    /([Ttτ][Aa][Oo0]|[绹陶掏]).{0,4}([寶寳]|[Bb][Aa][Oo])/, // 这就是塞翁一族的生存方式吗，真是有够好笑的 0.1.4
    /(本地.{0,4}[可能].{0,4}玩|你.{0,4}找.{0,4}([什神][么马]|[那内][种个])).*我.{0,4}(关注.{0,4}吧|吧.{0,4}[列表])/, // 0.1.5
    /([首手资][充源冲]号).{0,8}手[机鸡]?[遊游]|[福浮付][利丽力].{0,12}[返反]利/, // 0.1.7
    /((短视频|抖音|剪辑|涨粉|热门|变现|带货).{0,3}){3,}/, // 0.1.7
    //2.{0,2}4.{0,2}3.{0,2}4.{0,2}3.{0,2}5.{0,2}5.{0,2}4.{0,2}/, // 黑名单QQ 0.1.7
    //w.{0,2}h.{0,2}x.{0,2}n.{0,2}6.{0,2}4.{0,2}6.{0,2}6/, // 黑名单微信 0.1.7
    /([徽微嶶薇威vV][xX信]|公众号).{0,5}[查茶].{0,14}(风险|逾期)/, // 0.1.9
    /(白|每[天日周]|上[线号]).?[送给給宋].*([福浮].?[利力]|[充冲].?[值钱前])/, // 0.2.0
  ],
  [SALACITY]: [
    /奔现.*[那人种].*有/, //不奔现，怕你自卑 0.1.0
    /缺.*[女男]朋?友.*[女男]朋?友/, //缺，但请你不要为祸人间 0.1.0
    /的.*[女妹].*有人.*要.*嘛/, //不要，贱（指卖不出好价钱），可能会误伤 0.1.0
    /[臭弟].*现.*直[白接].*[撩性]/, //你也就这样了 0.1.1
    /网恋.*对象.*诚/, // 丑 拒 0.1.1
    /[姐妹].{0,4}甜.{0,4}你.{0,4}[尝试]/, // 丑 拒 0.1.2
    /[姐妹哥弟].{0,4}来.{0,4}我.{0,4}聊天.{0,4}好(不好|[呀嘛吗])/, // 丑 拒 0.1.2
    /你.*主动.{0,4}我.{0,6}(有|发生).{0,4}故事/, // 这个可能会误伤 0.1.2
    /认真.{0,3}处一?个?对象/, // 滚 0.1.3
    /^[\d一二三四五六七八九十零\s]+[年届牛].{0,3}小?[姐妹哥弟]+.?$/, // 你们就算晚我十年出生，那也比我老多了 0.1.4
    /(漂亮|玩).{0,6}[姐妹].{0,4}[呀嘛吗]/, // 丑 拒 0.1.5
    /[初找寻交处Cc].{0,4}(对象|[朋扣跑炮泡砲QqOo]友|网恋).{0,4}(私|外[泄协]|[超可][甜爱])/, // 丑 拒 0.1.5
    /(在.{0,4}[哥弟]|[哥弟].{0,4}在).{0,6}[私聊陪](我|人家|[姐妹])/, // 丑 拒 0.1.5
    /9.{0,6}阿姨.{0,4}(对象|[朋扣跑炮泡砲QqOo]友|介意.{0,4}来)/, // 哈，你也知道你是阿姨啊 0.1.5
    /头像.{0,4}下面.{0,6}(想要|[姐妹]|喜欢)/, // 丑 拒 0.1.6
    /[哥弟].{0,6}[网谈]恋.{0,6}(音|斤)/, // 0.1.8
    /[MmGgPp大多汁水].{0,6}([盘磐潘]|[Pp][Aa][Nn]).{0,4}[源原料].{0,6}([辑集]|[尽都仅全]在)/, // 0.1.9
  ],
  [SWEARING]: [
    /([麻马码妈蚂]|🐴)[^烦]?[碧哔逼Bb四私司死丝屎失4④爆暴炸扎乍诈烂]/, // 0.1.9
    /[四私司死丝屎失4④废飞无没無送屄].?([麻码妈蚂]|🐴)/, // 0.1.9
    /[你您妳].?([麻码蚂]|🐴)|[您妳].?([麻码妈蚂]|🐴)/, // 0.1.9
    /(🐴.{0,3}){5}/, // 0.1.9
    /[傻臭丑癌][卵屌屄]/, // 0.1.9
    /废.?物.?也?就?.?只/, // 0.1.9
    /[迷MmQq][你CcNn]([痴狗苟]|🐶)/, // 有完没完 0.1.9
  ],
}
/** 标题特殊处理 */
export const titleReg = [
  /(良心|[不无][氪课]|[新刚缸][出开]|1\.\d+\.\d).*(神奇宝贝|宝可梦|口袋妖[怪精]|poc?k[eé]t?[mn][oa][mn]).*服/i, // 宝可梦是重灾区 0.1.2
  /(问题|怎么(办|解决)).*([加+＋夹甲家].{0,3}[徽微嶶薇vq扣]|[徽微嶶薇v]\s?[x信]|[q扣企＋加][q扣鹅])/i, // ？？？？ 0.1.2
  /[招找](托|tu?o|内[部补玩][玩人][员家号].{0,7}(特权|福利))/i, // 再见 0.1.2
  /进?手?[游蝣遊][戏戲]?.*内[部补玩][玩人][员家号]/, // 0.1.3
  /([看读].?[视小][频说]).*赚钱.*[你我]/, //0.1.3
  /[工厂][家厂].*直接?[发销].*(手工|串珠|饰品|组装)/, // 0.1.3
  /[博菠播].{0,3}[财菜彩].*([评平坪][台抬]|联系|[Qq扣企＋加][Qq扣鹅])/, // 底线之所以是底线 0.1.3
  /((\d\.\d\d?\.\d|[工生空海酸p][业存液岛g]服|[养休纯o][老闲净d]服|服务器|副本|RPG|武器|通用机械|炫酷|劲爆|刺激|锻造|分解|强化|结婚|冰与?火之?歌?|格雷|工业|AE2|[和茶]风|红枫|植物?魔法?|拔刀剑?|神秘|神奇宝贝|宝可梦|口?袋?[精妖][灵怪]|匠魂|巫术|盖亚|污秽|舰娘|深渊国?度?|考古与?化石|龙之?[研进][化究]?|汰那|修真|星辉|战?斗?(宠物|女仆)|潘马斯|沉浸|虚无|粘液科?技?|电气时?代?|远古工?艺?|登[录陆]送|[多重送豪爽大]礼[包物品]?|(新.{1,3})?开荒).{0,6}){3}/i, // 什么奇葩服务器宣传 0.1.4
  /(抖音|[徽微嶶薇vV]\s?[xX信]).*(粉.*涨|涨.*粉).*(技巧|教程|攻略)/, // 你粉丝暴涨一个给我看看 0.1.5
  /分享了?一?个?小程序[，,]快?进?来看看吧/, // 0.1.5
  /(白|每[天日周]|上[线号]).?[送给給宋].*([福浮].?[利力]|[充冲].?[值钱前])|[福浮].?[利力].*(白|每[天日周]|上[线号]).?[送给給宋]/, // 0.1.6
  /[仙剑武][剑侠].*新游/, // 0.1.7
  /((武器|炫酷|劲爆|刺激|锻造|分解|强化|结婚|格雷|工业|植物?魔法?|拔刀剑?|宝可梦|精灵|魂[骨骸器核]|[灵魂]宠|新服).{0,7}){3,}/, // 针对服务器推销 0.1.7
  /1.\d\d?.\d.+((科技|魔[法幻]|RPG|[空海]岛|生存|本服).{0,5}){3,}/i, // 针对服务器推销 0.1.7
  /(我的世界|mine\s?craft|mc[^Ll启]).*(神奇宝贝|宝可梦|(魔塔|[艾埃][尔拉露]).{0,4}服)/i, // 针对标题都不好好起的服务器宣传 0.1.7
  /(神奇宝贝|宝可梦|魔塔|[艾埃][尔拉露]).*(我的世界|mine\s?craft|mc)/i, // 针对标题都不好好起的服务器宣传 0.1.7
  /((🔥|🌸|🍁|✨|⭐|📱|💗|🌹|💖|💞).*){5}/, // 针对标题都不好好起的服务器宣传 0.1.7
  /服务器名称?.+(有效状态|服务器(规模|版本))/, // 针对标题都不好好起的服务器宣传 0.1.7
  /^[【\[\{\(](精.{0,2}[品华]|贴?吧?主?推荐)[】\]\}\)]/, //精品你个**鬼！ 0.1.7
  /#(宝可梦|口?袋?[精妖][灵怪]|神奇宝贝)#/, // 方便我查？ 0.1.8
  /手?[游蝣遊][戏戲]?.*(体验)[玩人]?[员家号]/, // 0.1.8
  /[处找Cc].?[男女蓝铝吕栏]?[Cc对Qq朋][Pp象友]/, // 处你个大头鬼 0.1.8
  /(广告|推广).{0,9}(精准|低).{0,9}(曝光|成本)/, // 推广 0.1.9
  /^[蹲等]单?中?$/, // ？ 0.2.0
]

