/*
 * @Author: Salt
 * @Date: 2022-05-01 13:14:29
 * @LastEditors: Salt
 * @LastEditTime: 2022-05-01 13:55:42
 * @Description: 服务器宣传帖可能起的名字
 * @FilePath: \better-tieba\src\modules\antiSpam\constant-serverTitle.ts
 */
const serverTitle = [
  '\\d\\.\\d\\d?\\.\\d',
  '(新.{1,3})?开荒?', // 新服开荒
  '[工生空海酸p][业存液岛g]服务?器?',
  '[养休纯模o][老闲净组d]服务?器?',
  '原?汁?原味',
  '登[录陆]送',
  '[多重送豪爽大]礼[包物品]?',
  '妹子([腐辅服管o][竹助主理p]|很?比?较?非?常?多)',
  // 游戏类型
  '副本',
  'RPG',
  '武器',
  // 游戏模组
  '通用机械',
  '炫酷',
  '劲爆',
  '刺激',
  '锻造',
  '分解',
  '强化',
  '结婚',
  '时装',
  '冰与?火之?歌?',
  '格雷',
  'AE2',
  '[和茶]风',
  '红枫',
  '植物?魔法?',
  '拔刀剑?',
  '神秘',
  '神奇宝贝',
  '宝可梦',
  '口?袋?[精妖][灵怪]',
  '匠魂',
  '巫术',
  '盖亚',
  '污秽',
  '舰娘',
  '深渊国?度?',
  '考古与?化石',
  '龙之?[研进][化究]?',
  '汰那',
  '修真',
  '星辉',
  '战?斗?(宠物|女仆)',
  '潘马斯',
  '沉浸',
  '虚无',
  '粘液科?技?',
  '(电气|科技|工业)时?代?',
  '远古工?艺?',
]

const serverTitleReg = new RegExp(`((${serverTitle.join('|')}).{0,6}){3}`, 'i')

export default serverTitleReg
